In [107]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 1D Series
# 2D DataFrame
# 3D Panel
# 4D Panels

In [108]:
arr1 = np.array([1,2,3,4,5,6])

In [109]:
pd.Series(arr1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [110]:
dict1 = {
    'Sagar': 22,
    'Nikhil': 23,
    'Suneel': 24
}

In [111]:
s = pd.Series(dict1)

In [112]:
s['Sagar']

22

In [113]:
s.index

Index(['Sagar', 'Nikhil', 'Suneel'], dtype='object')

In [114]:
s.values

array([22, 23, 24], dtype=int64)

In [115]:
cars = {
    'model': ['Toyota','Lamborghini','BMW','Audi','Ferrari','Mercedes Benz'],
    'price': [45,56,67,87,67,65],
    'color': ['black','white','red','blue','brown','grey']
}

In [116]:
cars

{'model': ['Toyota', 'Lamborghini', 'BMW', 'Audi', 'Ferrari', 'Mercedes Benz'],
 'price': [45, 56, 67, 87, 67, 65],
 'color': ['black', 'white', 'red', 'blue', 'brown', 'grey']}

In [117]:
pd.DataFrame(cars)

           model  price  color
0         Toyota     45  black
1    Lamborghini     56  white
2            BMW     67    red
3           Audi     87   blue
4        Ferrari     67  brown
5  Mercedes Benz     65   grey

In [118]:
cars['model'][4].split('r')

['Fe', '', 'a', 'i']

In [119]:
np.random.seed(10)
array1 = np.random.randint(25,50,(5,6))

In [120]:
array1

array([[34, 29, 40, 25, 42, 41],
       [42, 33, 34, 25, 35, 33],
       [47, 29, 44, 41, 29, 40],
       [36, 47, 49, 36, 26, 33],
       [29, 39, 42, 44, 47, 38]])

In [121]:
students = ['Rahul','Sagar','Suneel','Rohit','Nikhil']

In [122]:
subjects = ['Physics','Chemistry','mathematics','Computer Science','English','Kannada']

In [123]:
marks = pd.DataFrame(array1,index=students,columns=subjects)

In [124]:
marks

        Physics  Chemistry  mathematics  Computer Science  English  Kannada
Rahul        34         29           40                25       42       41
Sagar        42         33           34                25       35       33
Suneel       47         29           44                41       29       40
Rohit        36         47           49                36       26       33
Nikhil       29         39           42                44       47       38

In [125]:
type(marks)

pandas.core.frame.DataFrame

In [126]:
marks.size

30

In [127]:
marks.shape

(5, 6)

In [128]:
marks.ndim

2

In [129]:
marks['Chemistry'].dtype

dtype('int32')

In [130]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Rahul to Nikhil
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Physics           5 non-null      int32
 1   Chemistry         5 non-null      int32
 2   mathematics       5 non-null      int32
 3   Computer Science  5 non-null      int32
 4   English           5 non-null      int32
 5   Kannada           5 non-null      int32
dtypes: int32(6)
memory usage: 160.0+ bytes

In [131]:
marks['Total Marks'] = marks['Physics'] + marks['Chemistry'] + marks['mathematics'] + marks['Computer Science'] + marks['English'] + marks['Kannada']

In [132]:
marks

,Physics,Chemistry,mathematics,Computer Science,English,Kannada,Total Marks
Rahul,34,29,40,25,42,41,211
Sagar,42,33,34,25,35,33,202
Suneel,47,29,44,41,29,40,230
Rohit,36,47,49,36,26,33,227
Nikhil,29,39,42,44,47,38,239

In [133]:
marks['percentage'] = round((marks['Total Marks']/3),2)

In [134]:
marks

,Physics,Chemistry,mathematics,Computer Science,English,Kannada,Total Marks,percentage
Rahul,34,29,40,25,42,41,211,70.33
Sagar,42,33,34,25,35,33,202,67.33
Suneel,47,29,44,41,29,40,230,76.67
Rohit,36,47,49,36,26,33,227,75.67
Nikhil,29,39,42,44,47,38,239,79.67

In [135]:
marks['Total'] = marks.sum(axis=1)

In [136]:
marks

,Physics,Chemistry,mathematics,Computer Science,English,Kannada,Total Marks,percentage,Total
Rahul,34,29,40,25,42,41,211,70.33,492.33
Sagar,42,33,34,25,35,33,202,67.33,471.33
Suneel,47,29,44,41,29,40,230,76.67,536.67
Rohit,36,47,49,36,26,33,227,75.67,529.67
Nikhil,29,39,42,44,47,38,239,79.67,557.67

In [137]:
marks.drop(columns=['Total'],inplace=True)

In [138]:
marks

,Physics,Chemistry,mathematics,Computer Science,English,Kannada,Total Marks,percentage
Rahul,34,29,40,25,42,41,211,70.33
Sagar,42,33,34,25,35,33,202,67.33
Suneel,47,29,44,41,29,40,230,76.67
Rohit,36,47,49,36,26,33,227,75.67
Nikhil,29,39,42,44,47,38,239,79.67

In [139]:
new_student = pd.DataFrame({
    'Physics': 45,
    'Chemistry': 34,
    'mathematics': 49,
    'Computer Science': 44,
    'English': 48,
    'Kannada': 50
},index=['Anil'])

In [140]:
marks = pd.concat([marks,new_student])

In [141]:
marks

,Physics,Chemistry,mathematics,Computer Science,English,Kannada,Total Marks,percentage
Rahul,34,29,40,25,42,41,211.0,70.33
Sagar,42,33,34,25,35,33,202.0,67.33
Suneel,47,29,44,41,29,40,230.0,76.67
Rohit,36,47,49,36,26,33,227.0,75.67
Nikhil,29,39,42,44,47,38,239.0,79.67
Anil,45,34,49,44,48,50,NaN,NaN